test/good/false-condition.cfg.mmd
graph TD
subgraph test1
    test1_68["if (false)"]
    test1_69["while (false)"]
    test1_70["until (false)"]
    test1_71["repeat (0)"]
    test1_72["if (false)"]
    test1_73["return 1"]:::exitNode
    test1_74["if (false)"]
    test1_75["return 1"]:::exitNode
    test1_76["while (false)"]
    test1_77["return 1"]:::exitNode
    test1_78["repeat (0)"]
    test1_79["return 1"]:::exitNode
    test1_80["return false && true ? 1 : 2"]:::exitNode
    test1_68 --> test1_69
    test1_69 --> test1_69
    test1_69 --> test1_70
    test1_70 --> test1_70
    test1_70 --> test1_71
    test1_71 --> test1_71
    test1_71 --> test1_72
    test1_72 --> test1_73
    test1_73 --> test1_74
    test1_74 --> test1_75
    test1_75 --> test1_76
    test1_76 --> test1_77
    test1_77 --> test1_76
    test1_76 --> test1_78
    test1_78 --> test1_79
    test1_79 --> test1_78
    test1_78 --> test1_80
end
